Revit 2015 API
BoundarySegmentArrayIterator Constructor
For Internal Use Only.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public BoundarySegmentArrayIterator()
Visual Basic
Public Sub New
Visual C++
public:
BoundarySegmentArrayIterator()
Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.
See Also
BoundarySegmentArrayIterator Class
Autodesk.Revit.DB.Architecture Namespace